#!/usr/bin/python
# -*- coding: UTF-8 -*-
#用来存储一二三线城市名单
class CityClass:

    TierOneCities = ('北京', '上海', '广州', '深圳')
    NewTierOneCites = ('成都', '重庆', '杭州', '武汉', '西安', '天津', '苏州', '南京', '郑州', '长沙', '东莞', '沈阳', '青岛', '合肥', '佛山')
    TierTwoCities = ('无锡', '宁波', '昆明', '大连', '福州', '厦门', '哈尔滨', '济南', '温州', '南宁', '长春', '泉州', '石家庄', '贵阳', '南昌',
                     '金华', '常州', '南通', '嘉兴', '太原', '徐州', '惠州', '珠海', '中山', '台州', '烟台', '兰州', '绍兴', '海口', '扬州')
    TierThreeCities = ('汕头', '湖州', '盐城', '潍坊', '保定', '镇江', '洛阳', '泰州', '乌鲁木齐', '临沂', '唐山', '漳州', '赣州', '廊坊',
                       '呼和浩特', '芜湖', '桂林', '银川', '揭阳', '三亚', '遵义', '江门', '济宁', '莆田', '湛江', '绵阳', '淮安', '连云港',
                       '淄博', '宜昌', '邯郸', '上饶', '柳州', '舟山', '咸阳', '九江', '衡阳', '威海', '宁德', '阜阳', '株洲', '丽水',
                       '南阳', '襄阳', '大庆', '沧州', '信阳', '岳阳', '商丘', '肇庆', '清远', '滁州', '龙岩', '荆州', '蚌埠', '新乡',
                       '鞍山', '湘潭', '马鞍山', '三明', '潮州', '梅州', '秦皇岛', '南平', '吉林', '安庆', '泰安', '宿迁', '包头', '郴州', '南充')

    def __init__(self):
        pass


    def getCites(self):
        return self.TierOneCities,self.NewTierOneCites,self.TierTwoCities,self.TierThreeCities
        pass